ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32U5/TARGET_STM32U575xI/TARGET_NUCLEO_U575ZI_Q/PeripheralPins.c
/* mbed Microcontroller Library
 * SPDX-License-Identifier: BSD-3-Clause
 ******************************************************************************
 *
 * Copyright (c) 2016-2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 *
 * Automatically generated from STM32CubeMX/db/mcu/STM32U575ZITxQ.xml
 */

#include "PeripheralPins.h"
#include "mbed_toolchain.h"

//==============================================================================
// Notes
//
// - The pins mentioned Px_y_ALTz are alternative possibilities which use other
//   HW peripheral instances. You can use them the same way as any other "normal"
//   pin (i.e. PwmOut pwm(PA_7_ALT0);). These pins are not displayed on the board
//   pinout image on mbed.org.
//
// - The pins which are connected to other components present on the board have
//   the comment "Connected to xxx". The pin function may not work properly in this
//   case. These pins may not be displayed on the board pinout image on mbed.org.
//   Please read the board reference manual and schematic for more information.
//
// - Warning: pins connected to the default STDIO_UART_TX and STDIO_UART_RX pins are commented
//   See https://os.mbed.com/teams/ST/wiki/STDIO for more information.
//
//==============================================================================


//*** GPIO ***

MBED_WEAK const PinMap PinMap_GPIO[] = {
    {PA_0,  0, GPIO_NOPULL},
    {PA_1,  0, GPIO_NOPULL},
    {PA_2,  0, GPIO_NOPULL},
    {PA_3,  0, GPIO_NOPULL},
    {PA_4,  0, GPIO_NOPULL},
    {PA_5,  0, GPIO_NOPULL},
    {PA_6,  0, GPIO_NOPULL},
    {PA_7,  0, GPIO_NOPULL},
    {PA_8,  0, GPIO_NOPULL},
    {PA_9,  0, GPIO_NOPULL}, // Connected to USART1_TX
    {PA_10, 0, GPIO_NOPULL}, // Connected to USART1_RX
    {PA_11, 0, GPIO_NOPULL}, // Connected to USB_OTG_FS_DM
    {PA_12, 0, GPIO_NOPULL}, // Connected to USB_OTG_FS_DP
    {PA_13, 0, GPIO_NOPULL},
    {PA_14, 0, GPIO_NOPULL},
    {PA_15, 0, GPIO_NOPULL},
    {PB_0,  0, GPIO_NOPULL},
    {PB_1,  0, GPIO_NOPULL},
    {PB_2,  0, GPIO_NOPULL},
    {PB_3,  0, GPIO_NOPULL},
    {PB_4,  0, GPIO_NOPULL},
    {PB_5,  0, GPIO_NOPULL}, // Connected to UCPD_DBn
    {PB_6,  0, GPIO_NOPULL},
    {PB_7,  0, GPIO_NOPULL}, // Connected to LED_BLUE
    {PB_8,  0, GPIO_NOPULL},
    {PB_9,  0, GPIO_NOPULL},
    {PB_10, 0, GPIO_NOPULL},
    {PB_11, 0, GPIO_NOPULL},
    {PB_13, 0, GPIO_NOPULL},
    {PB_14, 0, GPIO_NOPULL}, // Connected to UCPD_FLT
    {PB_15, 0, GPIO_NOPULL}, // Connected to UCPD1_CC2
    {PC_0,  0, GPIO_NOPULL},
    {PC_1,  0, GPIO_NOPULL},
    {PC_2,  0, GPIO_NOPULL}, // Connected to VBUS_SENSE
    {PC_3,  0, GPIO_NOPULL},
    {PC_6,  0, GPIO_NOPULL},
    {PC_7,  0, GPIO_NOPULL}, // Connected to LED_GREEN
    {PC_8,  0, GPIO_NOPULL},
    {PC_9,  0, GPIO_NOPULL},
    {PC_10, 0, GPIO_NOPULL},
    {PC_11, 0, GPIO_NOPULL},
    {PC_12, 0, GPIO_NOPULL},
    {PC_13, 0, GPIO_NOPULL}, // Connected to USER_BUTTON
//  {PC_14, 0, GPIO_NOPULL}, // PC14-OSC32_IN (PC14)
//  {PC_15, 0, GPIO_NOPULL}, // PC15-OSC32_OUT (PC15)
    {PD_0,  0, GPIO_NOPULL},
    {PD_1,  0, GPIO_NOPULL},
    {PD_2,  0, GPIO_NOPULL},
    {PD_3,  0, GPIO_NOPULL},
    {PD_4,  0, GPIO_NOPULL},
    {PD_5,  0, GPIO_NOPULL},
    {PD_6,  0, GPIO_NOPULL},
    {PD_7,  0, GPIO_NOPULL},
    {PD_8,  0, GPIO_NOPULL},
    {PD_9,  0, GPIO_NOPULL},
    {PD_10, 0, GPIO_NOPULL},
    {PD_11, 0, GPIO_NOPULL},
    {PD_12, 0, GPIO_NOPULL},
    {PD_13, 0, GPIO_NOPULL},
    {PD_14, 0, GPIO_NOPULL},
    {PD_15, 0, GPIO_NOPULL},
    {PE_0,  0, GPIO_NOPULL},
    {PE_1,  0, GPIO_NOPULL},
    {PE_2,  0, GPIO_NOPULL},
    {PE_3,  0, GPIO_NOPULL},
    {PE_4,  0, GPIO_NOPULL},
    {PE_5,  0, GPIO_NOPULL},
    {PE_6,  0, GPIO_NOPULL},
    {PE_7,  0, GPIO_NOPULL},
    {PE_8,  0, GPIO_NOPULL},
    {PE_9,  0, GPIO_NOPULL},
    {PE_10, 0, GPIO_NOPULL},
    {PE_11, 0, GPIO_NOPULL},
    {PE_12, 0, GPIO_NOPULL},
    {PE_13, 0, GPIO_NOPULL},
    {PE_14, 0, GPIO_NOPULL},
    {PE_15, 0, GPIO_NOPULL},
    {PF_0,  0, GPIO_NOPULL},
    {PF_1,  0, GPIO_NOPULL},
    {PF_2,  0, GPIO_NOPULL},
    {PF_3,  0, GPIO_NOPULL},
    {PF_4,  0, GPIO_NOPULL},
    {PF_5,  0, GPIO_NOPULL},
    {PF_6,  0, GPIO_NOPULL},
    {PF_7,  0, GPIO_NOPULL},
    {PF_8,  0, GPIO_NOPULL},
    {PF_9,  0, GPIO_NOPULL},
    {PF_10, 0, GPIO_NOPULL},
    {PF_11, 0, GPIO_NOPULL},
    {PF_12, 0, GPIO_NOPULL},
    {PF_13, 0, GPIO_NOPULL},
    {PF_14, 0, GPIO_NOPULL},
    {PF_15, 0, GPIO_NOPULL},
    {PG_0,  0, GPIO_NOPULL},
    {PG_1,  0, GPIO_NOPULL},
    {PG_2,  0, GPIO_NOPULL}, // Connected to LED_RED
    {PG_3,  0, GPIO_NOPULL},
    {PG_4,  0, GPIO_NOPULL},
    {PG_5,  0, GPIO_NOPULL},
    {PG_6,  0, GPIO_NOPULL},
    {PG_7,  0, GPIO_NOPULL},
    {PG_8,  0, GPIO_NOPULL},
    {PG_9,  0, GPIO_NOPULL},
    {PG_10, 0, GPIO_NOPULL},
    {PG_12, 0, GPIO_NOPULL},
    {PG_13, 0, GPIO_NOPULL},
    {PG_14, 0, GPIO_NOPULL},
    {PG_15, 0, GPIO_NOPULL},
//  {PH_0,  0, GPIO_NOPULL}, // PH0-OSC_IN (PH0)
//  {PH_1,  0, GPIO_NOPULL}, // PH1-OSC_OUT (PH1)
    {PH_3,  0, GPIO_NOPULL}, // PH3-BOOT0
    {NC, NC, 0}
};

//*** ADC ***

MBED_WEAK const PinMap PinMap_ADC[] = {
    {PA_0,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC1_IN5
    {PA_1,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 6, 0)}, // ADC1_IN6
    {PA_2,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 7, 0)}, // ADC1_IN7
    {PA_3,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 8, 0)}, // ADC1_IN8
    {PA_4,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 9, 0)}, // ADC1_IN9
    {PA_4_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 9, 0)}, // ADC4_IN9
    {PA_5,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 10, 0)}, // ADC1_IN10
    {PA_5_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 10, 0)}, // ADC4_IN10
    {PA_6,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 11, 0)}, // ADC1_IN11
    {PA_6_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 11, 0)}, // ADC4_IN11
    {PA_7,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 12, 0)}, // ADC1_IN12
    {PA_7_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 20, 0)}, // ADC4_IN20
    {PB_0,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 15, 0)}, // ADC1_IN15
    {PB_0_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 18, 0)}, // ADC4_IN18
    {PB_1,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 16, 0)}, // ADC1_IN16
    {PB_1_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 19, 0)}, // ADC4_IN19
    {PB_2,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 17, 0)}, // ADC1_IN17
    {PC_0,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // ADC1_IN1
    {PC_0_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // ADC4_IN1
    {PC_1,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // ADC1_IN2
    {PC_1_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // ADC4_IN2
    {PC_2,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 3, 0)}, // ADC1_IN3 // Connected to VBUS_SENSE
    {PC_2_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 3, 0)}, // ADC4_IN3 // Connected to VBUS_SENSE
    {PC_3,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 4, 0)}, // ADC1_IN4
    {PC_3_ALT0,  ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 4, 0)}, // ADC4_IN4
    {PD_11,      ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 15, 0)}, // ADC4_IN15
    {PD_12,      ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 16, 0)}, // ADC4_IN16
    {PD_13,      ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 17, 0)}, // ADC4_IN17
    {PF_14,      ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC4_IN5
    {PF_15,      ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 6, 0)}, // ADC4_IN6
    {PG_0,       ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 7, 0)}, // ADC4_IN7
    {PG_1,       ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 8, 0)}, // ADC4_IN8
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_ADC_Internal[] = {
    {ADC_TEMP,   ADC_1,    STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 19, 0)},
    {ADC_VREF,   ADC_1,    STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 0, 0)},
	{ADC_VBAT,   ADC_1,    STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 18, 0)},
    {NC, NC, 0}
};

//*** DAC ***

MBED_WEAK const PinMap PinMap_DAC[] = {
    {PA_4,       DAC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // DAC1_OUT1
    {PA_5,       DAC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // DAC1_OUT2
    {NC, NC, 0}
};

//*** I2C ***

MBED_WEAK const PinMap PinMap_I2C_SDA[] = {
    {PB_3,       I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
    {PB_4,       I2C_3, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C3)},
    {PB_7,       I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)}, // Connected to LED_BLUE
    {PB_7_ALT0,  I2C_4, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF5_I2C4)}, // Connected to LED_BLUE
    {PB_9,       I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
    {PB_11,      I2C_2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
    {PB_11_ALT0, I2C_4, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF3_I2C4)},
    {PB_14,      I2C_2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)}, // Connected to UCPD_FLT
    {PC_1,       I2C_3, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C3)},
    {PD_13,      I2C_4, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C4)},
    {PF_0,       I2C_2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
    {PF_15,      I2C_4, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C4)},
//  {PG_8,       I2C_3, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C3)},
    {PG_13,      I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_I2C_SCL[] = {
    {PA_7,       I2C_3, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C3)},
    {PB_6,       I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
    {PB_6_ALT0,  I2C_4, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF5_I2C4)},
    {PB_8,       I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
    {PB_10,      I2C_2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
    {PB_10_ALT0, I2C_4, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF3_I2C4)},
    {PB_13,      I2C_2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
    {PC_0,       I2C_3, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C3)},
    {PD_12,      I2C_4, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C4)},
    {PF_1,       I2C_2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
    {PF_14,      I2C_4, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C4)},
    {PG_7,       I2C_3, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C3)},
    {PG_14,      I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
    {NC, NC, 0}
};

